#### 시리즈 메서드 과제 1
- append
- describe
- drop_duplicates
- equals
- get_values
- isin
- min
- max
- mean
- median
- replace
- sample
- sort_value
- to_frame

주석 처리로 메소드의 작동에 대한 설명!

#### append

- list 의 append 처럼 Pandas Series 에 값을 넣어주는 함수이다.

- 리스트의 append와 한 가지 다른 점은,append만 쓰고 끝나면 안 되고 반환되는 시리즈를 특정 변수에 넣어주어야 함수가 작동한다.

In [12]:
import pandas as pd

a = {"a" : 2, "b":"hi", "c":5, "d":"안녕"}
b = ["a", "b", "c"]
var1 = pd.Series(a)
var2 = pd.Series(b)

In [13]:
var1.to_frame()

    0
a   2
b  hi
c   5
d  안녕

In [14]:
var2.to_frame()

   0
0  a
1  b
2  c

In [15]:
# append 사용
var1 = var1.append(var2)

In [16]:
var1.to_frame()

    0
a   2
b  hi
c   5
d  안녕
0   a
1   b
2   c

var2 시리즈가 var1 시리즈 밑에 이어붙여진 것을 확인 할 수 있다.

#### describe

- 연산이 가능한 숫자를 가진 칼럼을 뽑아내고 그 칼럼에 대한 기본 통계량(총 개수, 평균, 표준편차, 최소값, 퍼센트, 최댓값)을 산출한다.
- Series에 대한 각종 통계량을 요약해서 출력해준다.
- DataFrame의 경우에는 열에 대해 요약이 수행된다.
- 기본적으로 누락 데이터(NaN)은 제외되고 데이터 요약이 수행된다.

In [17]:
df = pd.read_csv('resource/mpg.csv')

In [18]:
df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [19]:
df.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

mpg 데이터에 describe() 함수를 적용하니, 숫자 데이터 형식을 가진 칼럼(displ 배기량, year 연도, cyl 실린더 개수, cty 도시연비, hwy 고속도로연비)에 대해, count 총 개수, mean 평균, std 표준편차, min 최솟값, 25%/50%/75% 백분위수, 최댓값이 나오는 것을 확인할 수 있다.

In [38]:
import pandas as pd

ser = pd.Series([10,20, 30, 40, 50])

In [39]:
ser.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

#### drop_duplicates

- 데이터를 수집하는 과정 중의 오류, 데이터를 병합하는 과정에서의 오류 등으로 인해서 중복되지 않아야 할 데이터가 중복되는 경우가 생길 수 있다.
- 특히 unique한 key 값을 관리해야 하는 경우에 중복이 발생하면 분석에 심각한 영향을 미칠 수도 있다.
- 이러한 중복 값을 처리해 주는 함수이다.

In [21]:
duplicated_df = pd.DataFrame({'k1' : ['one'] * 3 + ['two'] * 4,
                              'k2' : [1,1,2,3,3,4,4]})

In [22]:
duplicated_df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [23]:
duplicated_df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

위에서 겹치던 중복 행들이 제거된 것을 볼 수 있다. (중복 되는 것 중 가장 첫 번째 것만 남긴다.)

In [25]:
duplicated_df.drop_duplicates(keep = "last")

    k1  k2
1  one   1
2  one   2
4  two   3
6  two   4

keep 인자에 last를 넣어서 가장 마지막 행만을 남길 수도 있다.

In [32]:
import pandas as pd

series = pd.Series(['lama', 'cow', 'lama', 'beetle', 'lama', 'hippo'])

In [33]:
series.to_frame()

        0
0    lama
1     cow
2    lama
3  beetle
4    lama
5   hippo

In [34]:
series.drop_duplicates().to_frame()

        0
0    lama
1     cow
3  beetle
5   hippo

In [36]:
series.drop_duplicates(keep = "last").to_frame()

        0
1     cow
3  beetle
4    lama
5   hippo

시리즈에 대해서도 동일하게 적용 가능하다!

#### equals

2개의 시리즈를 서로 비교하여 모양과 요소가 동일한 지 확인할 수 있다.

In [5]:
df = pd.DataFrame({1:[10], 2:[20]})
df

    1   2
0  10  20

In [6]:
exactly_equal = pd.DataFrame({1:[10], 2:[20]})
exactly_equal

    1   2
0  10  20

In [7]:
df.equals(exactly_equal)

True

위와 같이 같이 완전히 동일한 데이터프레임에 대해서 equals 함수는 True를 반환할 것이다.

In [8]:
diff_col_type = pd.DataFrame({1.0:[10], 2.0:[20]})
diff_col_type

   1.0  2.0
0   10   20

In [10]:
df.equals(diff_col_type)

True

데이터프레임의 열 변수가 달라도 True를 반환한다.

In [12]:
data_list = [1,2,3,4,5]
series = pd.Series(data = data_list)

In [13]:
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
same_data_list = [1,2,3,4,5]
same_series = pd.Series(data = same_data_list)

In [21]:
same_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
series.equals(same_series)

True

시리즈에 대해서도 동일하게 적용된다!

#### get_values()

원하는 값을 불러오기 위해 사용하는 함수

In [40]:
import pandas as pd

In [48]:
ser = pd.Series([7,10,17,22,29, 8])
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp']
ser.index = index_
print(ser)

Coca Cola     7
Sprite       10
Coke         17
Fanta        22
Dew          29
ThumbsUp      8
dtype: int64

In [50]:
result = ser.to_numpy()

In [51]:
result

array([ 7, 10, 17, 22, 29,  8], dtype=int64)

get_values() 메소드는 더 이상 사용되지 않고(deprecated), 대신에 to_numpy() 메소드가 사용된다고 한다.

#### isin

시리즈의 값들 중에 찾고자 하는 값들이 있는지 확인할 때 사용

In [52]:
s = pd.Series(['lama', 'cow', 'lama', 'beetle', 'lama', 'hippo'], name = 'animal')

In [53]:
s.isin(['cow', 'lama'])

0     True
1     True
2     True
3    False
4     True
5    False
Name: animal, dtype: bool

해당 시리즈에 값이 있는지를 나타내는 시리즈를 반환한다.

#### replace

바꾸고자 하는 값을 원하는 값으로 변경해준다.

In [58]:
ss = pd.Series([1,2,3,4,5])
ss.replace(1,5)

0    5
1    2
2    3
3    4
4    5
dtype: int64

replace 함수는 시리즈 값 원본을 변경시키지는 않는다.

따라서 ss를 출력하면 변경하기 전 값이 출력된다.

In [75]:
ss

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### sample

In [76]:
df = pd.DataFrame({'num_legs' : [2,4,8,0],
                   'num_wings':[2,0,0,0],
                   'num_specimen_seen':[10,2,1,8]}
                 ,index = ['falcon', 'dog', 'spider', 'fish'])

In [77]:
df

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8

In [97]:
df['num_legs'].sample(n=3)

spider    8
fish      0
falcon    2
Name: num_legs, dtype: int64

sample 함수는 랜덤하게 샘플을 추출할 때 사용된다.

In [98]:
df['num_legs'].sample(n=3, random_state = 1)

fish      0
spider    8
falcon    2
Name: num_legs, dtype: int64

random_state 인자는 랜덤한 추출을 위한 seed로 작동한다.(?)

#### sort_value

데이터를 정렬할 때 사용한다.

In [100]:
s = pd.Series([np.nan, 1, 4, 10, 5])

In [101]:
s

0     NaN
1     1.0
2     4.0
3    10.0
4     5.0
dtype: float64

In [102]:
s.sort_values()

1     1.0
2     4.0
4     5.0
3    10.0
0     NaN
dtype: float64

In [106]:
s.sort_values()

1     1.0
2     4.0
4     5.0
3    10.0
0     NaN
dtype: float64

In [107]:
s.sort_values(ascending = False)

3    10.0
4     5.0
2     4.0
1     1.0
0     NaN
dtype: float64

sort_values 함수의 디폴트 정렬 방식은 오름차순 방식이다.

ascending 인자를 False로 설정해서 내림차순 정렬로 변경 가능하다.

NaN 값은 항상 정렬의 맨 뒤에 위치하지만 na_position 인자를 통해서 맨 앞으로 이동시킬 수 있다.

In [112]:
s.sort_values(ascending = False, na_position = 'first')

0     NaN
3    10.0
4     5.0
2     4.0
1     1.0
dtype: float64

#### to_frame

시리즈를 데이터 프레임 형태로 변환해준다
- 인자는 하나인데 시리즈의 이름(시리즈에 이름이 있다면)을 전달된 인자로 변경 가능
- 반환값은 DataFrame

In [2]:
import pandas as pd
s = pd.Series(["a", "b","c"], name = 'alphabet')

In [3]:
s

0    a
1    b
2    c
Name: alphabet, dtype: object

In [8]:
s = s.to_frame(name = "vals")
s

  vals
0    a
1    b
2    c